Autodesk.Revit.DB.RenderingQualitySettings.LightAndMaterialAccuracyMode
A value that controls light and material accuracy mode.
Remarks:
The method of the renderer engine dealing with materials and shadows.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value is not valid for LightAndMaterialAccuracyMode.
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2017

Autodesk.Revit.DB.RenderingQualitySettings.RenderingQuality
The quality applied for rendering.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value is not valid for RenderingQuality.
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration